Revit 2027 API
ExternalDataManagerDataItem.Path Property
 The saved path of the data item.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Path { get; set; }
Public Property Path As String
	Get
	Set
public:
property String^ Path {
	String^ get ();
	void set (String^ value);
}
member Path : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExternalDataManagerDataItem Class
Autodesk.Revit.UI Namespace